---
type: RebarShapeConstraint180DegreeDefaultBend
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 1
tags: [revit-api, class]
---

# RebarShapeConstraint180DegreeDefaultBend

`Autodesk.Revit.DB.Structure.RebarShapeConstraint180DegreeDefaultBend` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | RebarShapeConstraint180DegreeDefaultBend | 2012 | `public RebarShapeConstraint180DegreeDefaultBend ()` |